src/main/resources/files/TAXPE123REQ.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/ " xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns3:ECRecIpTaxExmpRqst  xmlns="FisCommonRqstHdr" xmlns:ns10="urn:Fis:ECRecordIpTaxExemptionRsp" xmlns:ns2="urn:Fis:ECBOMCommon" xmlns:ns3="urn:Fis:ECRecordIpTaxExemptionRqst" xmlns:ns4="urn:Fis:ECBOMInvolvedParty" xmlns:ns5="urn:Fis:ECDOMInvolvedParty" xmlns:ns6="urn:Fis:ECDOMCommon" xmlns:ns7="FisUsernameToken" xmlns:ns8="urn:Fis:ECBOMOrganizationalUnit" xmlns:ns9="FisCommonRspHdr"><RqstHdr><RqstHdrVer>2.0.0</RqstHdrVer><MsgUuid>d78554e0-71b9-11eb-95ec-4904ab9aff65</MsgUuid><SrcId>BackOffice</SrcId><LclPref>en-US</LclPref><Sec><TokenAuthen><ns7:UsernameToken><ns7:Username>T999999</ns7:Username></ns7:UsernameToken></TokenAuthen></Sec><ServPrmtrsLst><ServPrmtrs><FeId>5010</FeId><ServId>ECRecordIpTaxExemption</ServId><ServVer>1.0.0</ServVer><ApplId>EC_CUST</ApplId><FldLst><Fld><FldNme>WsId</FldNme><FldVal>10.7.196.8</FldVal></Fld></FldLst></ServPrmtrs></ServPrmtrsLst></RqstHdr><ns3:ECRecIpTaxExmpOsi><ns3:FeRqstKey><ns2:FeRqst><ns2:FeId>5010</ns2:FeId></ns2:FeRqst></ns3:FeRqstKey><ns3:IpRqstKey><ns5:EcIpId>70002596999</ns5:EcIpId></ns3:IpRqstKey><ns3:TaxExmp><ns3:ExmpMaint><ns3:Actn>Add</ns3:Actn><ns3:ExmpDtl><ns4:ExmpTyp><ns2:Val>TAXPE123</ns2:Val></ns4:ExmpTyp><ns4:ExmpStat><ns2:Val>WELOCME</ns2:Val></ns4:ExmpStat><ns4:ExmpOrdNbr>11223344</ns4:ExmpOrdNbr><ns4:ExmptAmtDtl><ns4:ExmptAmt><ns4:TotAmt><ns2:Amt>9989</ns2:Amt><ns2:CrncyCde>EUR</ns2:CrncyCde></ns4:TotAmt></ns4:ExmptAmt></ns4:ExmptAmtDtl></ns3:ExmpDtl></ns3:ExmpMaint></ns3:TaxExmp><ns3:MaintRqst><ns2:AccTyp>Admin User</ns2:AccTyp></ns3:MaintRqst></ns3:ECRecIpTaxExmpOsi></ns3:ECRecIpTaxExmpRqst></S:Body></S:Envelope>